#include "chapter03.h"

/*1. 通过试验（即编写带有此类问题的程序）观察系统如何处理整数上溢、浮点数上溢和浮点数下溢的情况。
 * 整形的上溢在书的48页有讲解，叫 整数溢出
 * 浮点数的上溢和下溢在书的58页有讲解
 * */

void main03__11_1() {
	int a = 2147483647;
	float b = 3.4E38 * 100.0f;
	float c = 0.1234E-10 / 10e100;

	// 整数上溢 2147483647 -2147483648 -2147483647
	// 对于整数溢出，如果是unsigned int类型的变量会从0开始，而int 类型的变量从-2147483648开始
	printf("%d %d %d\n", a, a + 1, a + 2);
	// 浮点数上溢 直接显示无穷大 inf
	printf("%e\n", b);
	// 浮点数下溢 -0.000000e+00
	// 书上原话：把最小的正浮点数除以2将得到一个低于正常的值，如果除以一个非常大的值，会导致所有的位都为0
	printf("%e\n", c);
}
